mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "TTCR1" -->
        <register>
          <name>TTCR1</name>
          <description>PPG Start Trigger Control Register 1 [BHW]</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG7O" -->
            <field>
              <name>TRG7O</name>
              <description>PPG7 trigger stop bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG5O" -->
            <field>
              <name>TRG5O</name>
              <description>PPG5 trigger stop bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG3O" -->
            <field>
              <name>TRG3O</name>
              <description>PPG3 trigger stop bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG1O" -->
            <field>
              <name>TRG1O</name>
              <description>PPG1 trigger stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "CS1" -->
            <field>
              <name>CS1</name>
              <description>8-bit UP counter clock select bits for comparison</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI1" -->
            <field>
              <name>MONI1</name>
              <description>8-bit UP counter operation state monitor bit for comparison</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR1" -->
            <field>
              <name>STR1</name>
              <description>8-bit UP counter operation enable bit for comparison</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTCR2" -->
        <register>
          <name>TTCR2</name>
          <description>PPG Start Trigger Control Register 2 [BHW]</description>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xF0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG22O" -->
            <field>
              <name>TRG22O</name>
              <description>PPG22 trigger stop bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG20O" -->
            <field>
              <name>TRG20O</name>
              <description>PPG20 trigger stop bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG18O" -->
            <field>
              <name>TRG18O</name>
              <description>PPG18 trigger stop bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TRG16O" -->
            <field>
              <name>TRG16O</name>
              <description>PPG16 trigger stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "CS2" -->
            <field>
              <name>CS2</name>
              <description>8-bit UP counter clock select bits for comparison</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI2" -->
            <field>
              <name>MONI2</name>
              <description>8-bit UP counter operation state monitor bit for comparison</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR2" -->
            <field>
              <name>STR2</name>
              <description>8-bit UP counter operation enable bit for comparison</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "COMP0" -->
        <register>
          <name>COMP0</name>
          <description>PPG Compare Register 0 [BHW]</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP2" -->
        <register>
          <name>COMP2</name>
          <description>PPG Compare Register 2 [BHW]</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP4" -->
        <register derivedFrom="COMP0">
          <name>COMP4</name>
          <description>PPG Compare Register 4 [BHW]</description>
          <addressOffset>0x11</addressOffset>
        </register>
        <!-- REGISTER "COMP6" -->
        <register derivedFrom="COMP2">
          <name>COMP6</name>
          <description>PPG Compare Register 6 [BHW]</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "COMP1" -->
        <register derivedFrom="COMP0">
          <name>COMP1</name>
          <description>PPG Compare Register 1 [BHW]</description>
          <addressOffset>0x29</addressOffset>
        </register>
        <!-- REGISTER "COMP3" -->
        <register derivedFrom="COMP2">
          <name>COMP3</name>
          <description>PPG Compare Register 3 [BHW]</description>
          <addressOffset>0x2C</addressOffset>
        </register>
