mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "BREG4B" -->
        <register>
          <name>BREG4B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4C" -->
        <register>
          <name>BREG4C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4D" -->
        <register>
          <name>BREG4D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4E" -->
        <register>
          <name>BREG4E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4F" -->
        <register>
          <name>BREG4F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x14F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG50" -->
        <register>
          <name>BREG50</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG51" -->
        <register>
          <name>BREG51</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x151</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG52" -->
        <register>
          <name>BREG52</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x152</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG53" -->
        <register>
          <name>BREG53</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x153</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG54" -->
        <register>
          <name>BREG54</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG55" -->
        <register>
          <name>BREG55</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x155</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG56" -->
        <register>
          <name>BREG56</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x156</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG57" -->
        <register>
          <name>BREG57</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x157</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG58" -->
        <register>
          <name>BREG58</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x158</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG59" -->
        <register>
          <name>BREG59</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x159</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5A" -->
        <register>
          <name>BREG5A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5B" -->
        <register>
          <name>BREG5B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5C" -->
        <register>
          <name>BREG5C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5D" -->
        <register>
          <name>BREG5D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x15D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
