mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "HWINTCLR7" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR7</name>
          <description>Hardware transfer interrupt clear Register 7 [BHW]</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK0" -->
        <register>
          <name>DQMSK0</name>
          <description>DMA request mask Register 0 [BHW]</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSK1" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK1</name>
          <description>DMA request mask Register 1 [BHW]</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DQMSK2" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK2</name>
          <description>DMA request mask Register 2 [BHW]</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "DQMSK3" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK3</name>
          <description>DMA request mask Register 3 [BHW]</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK4" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK4</name>
          <description>DMA request mask Register 4 [BHW]</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "DQMSK5" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK5</name>
          <description>DMA request mask Register 5 [BHW]</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "DQMSK6" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK6</name>
          <description>DMA request mask Register 6 [BHW]</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "DQMSK7" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK7</name>
          <description>DMA request mask Register 7 [BHW]</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR0" -->
        <register>
          <name>DQMSKCLR0</name>
          <description>DMA request mask clear Register 0 [BHW]</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSKCLR1" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR1</name>
          <description>DMA request mask clear Register 1 [BHW]</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR2" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR2</name>
          <description>DMA request mask clear Register 2 [BHW]</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR3" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR3</name>
          <description>DMA request mask clear Register 3 [BHW]</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR4" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR4</name>
          <description>DMA request mask clear Register 4 [BHW]</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR5" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR5</name>
          <description>DMA request mask clear Register 5 [BHW]</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR6" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR6</name>
          <description>DMA request mask clear Register 6 [BHW]</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR7" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR7</name>
          <description>DMA request mask clear Register 7 [BHW]</description>
          <addressOffset>0xAC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2S0" -->
    <peripheral>
      <name>I2S0</name>
      <description>I2S</description>
      <version>A</version>
      <groupName>I2S</groupName>
      <baseAddress>0x4006C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PCRC_I2S0_1" -->
      <interrupt>
        <name>PCRC_I2S0_1</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "RXFDAT" -->
        <register>
          <name>RXFDAT</name>
          <description>Receive FIFO Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXDATA" -->
            <field>
              <name>RXDATA</name>
              <description>Words received from the serial bus are written to the receive FIFO</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFDAT" -->
        <register>
          <name>TXFDAT</name>
          <description>Transmit FIFO Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description>The words to be transmitted can be written as long as the transmit FIFO is not full</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CNTREG" -->
        <register>
          <name>CNTREG</name>
          <description>Control Register [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKRT" -->
            <field>
              <name>CKRT</name>
              <description>This bit sets the clock division ratio for output when operating in master mode</description>
              <msb>31</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVHD" -->
            <field>
              <name>OVHD</name>
              <description>It can insert OVERHEAD bits to enable adjustment of the frame rate following the valid data of the frame</description>
              <msb>25</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSKB" -->
            <field>
              <name>MSKB</name>
              <description>This sets the serial output data of the invalid transmit frames</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSMD" -->
            <field>
              <name>MSMD</name>
              <description>This sets master or slave mode</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBFN" -->
            <field>
              <name>SBFN</name>
              <description>This specifies the subframe configuration (number of subframes) of the frame</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RHLL" -->
            <field>
              <name>RHLL</name>
              <description>This sets the FIFO word configuration to one or two words</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECKM" -->
            <field>
              <name>ECKM</name>
              <description>This selects the base clock divider in master mode</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEXT" -->
            <field>
              <name>BEXT</name>
              <description>This sets the upper bit extension mode when the receive word length is smaller than the FIFO word length</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRUN" -->
            <field>
              <name>FRUN</name>
              <description>This sets the output mode of the frame sync signal</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MLSB" -->
            <field>
              <name>MLSB</name>
              <description>This sets word bit shift order</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXDIS" -->
            <field>
              <name>TXDIS</name>
              <description>This enables or disables the transmit function</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDIS" -->
            <field>
              <name>RXDIS</name>
              <description>This enables or disables the receive function</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SMPL" -->
            <field>
              <name>SMPL</name>
              <description>This specifies the point where data is sampled</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description>This specifies the I2SCK polarity where drive sampling of the serial data is performed</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPH" -->
            <field>
              <name>FSPH</name>
              <description>This specifies the phase for I2SWS frame data</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSLN" -->
            <field>
              <name>FSLN</name>
              <description>This specifies the pulse width of I2SWS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPL" -->
            <field>
              <name>FSPL</name>
              <description>This sets the polarity of the I2SWS pin</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR0REG" -->
        <register>
          <name>MCR0REG</name>
          <description>Channel Control Register 0 [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S1CHN" -->
            <field>
              <name>S1CHN</name>
              <description>This sets the number of channels for subframe 1</description>
              <msb>30</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CHL" -->
            <field>
              <name>S1CHL</name>
              <description>This sets the channel length of the channels that make up subframe 1</description>
              <msb>25</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1WDL" -->
            <field>
              <name>S1WDL</name>
              <description>This sets the word length of the channels that make up subframe 1</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHN" -->
            <field>
              <name>S0CHN</name>
              <description>This sets the number of channels for subframe 0</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHL" -->
            <field>
              <name>S0CHL</name>
              <description>This sets the channel length of the channels that make up subframe 1</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0WDL" -->
            <field>
              <name>S0WDL</name>
              <description>This sets the word length of the channels that make up subframe 1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
