mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "PDOR6" -->
        <register>
          <name>PDOR6</name>
          <description>Port Output Data Register 6 [BHW]</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of PDOR6</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDOR6</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDOR6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDOR6</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDOR6</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDOR6</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDOR6</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDOR6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDOR6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PDOR7" -->
        <register>
          <name>PDOR7</name>
          <description>Port Output Data Register 7 [BHW]</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PC" -->
            <field>
              <name>PC</name>
              <description>Bit12 of PDOR7</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Bit11 of PDOR7</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description>Bit10 of PDOR7</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of PDOR7</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of PDOR7</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of PDOR7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PDOR7</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PDOR7</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of PDOR7</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PDOR7</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PDOR7</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of PDOR7</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PDOR7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
