mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "EPFR27" -->
        <register>
          <name>EPFR27</name>
          <description>Extended Pin Function Setting Register 27 [BHW]</description>
          <addressOffset>0x66C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HBINTXS" -->
            <field>
              <name>HBINTXS</name>
              <description>GE_HBINTX Input Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBRSTOXS" -->
            <field>
              <name>HBRSTOXS</name>
              <description>GE_HBRSTOX Input Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBRESETXE" -->
            <field>
              <name>HBRESETXE</name>
              <description>GE_HBRESETX Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBWPXE" -->
            <field>
              <name>HBWPXE</name>
              <description>GE_HBWPX Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ7B" -->
            <field>
              <name>HBDQ7B</name>
              <description>GE_HBDQ7 Input/Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ6B" -->
            <field>
              <name>HBDQ6B</name>
              <description>GE_HBDQ6 Input/Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ5B" -->
            <field>
              <name>HBDQ5B</name>
              <description>GE_HBDQ5 Input/Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ4B" -->
            <field>
              <name>HBDQ4B</name>
              <description>GE_HBDQ4 Input/Output Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ3B" -->
            <field>
              <name>HBDQ3B</name>
              <description>GE_HBDQ3 Input/Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ2B" -->
            <field>
              <name>HBDQ2B</name>
              <description>GE_HBDQ2 Input/Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ1B" -->
            <field>
              <name>HBDQ1B</name>
              <description>GE_HBDQ1 Input/Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBDQ0B" -->
            <field>
              <name>HBDQ0B</name>
              <description>GE_HBDQ0 Input/Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBRWDSB" -->
            <field>
              <name>HBRWDSB</name>
              <description>GE_HBRWDS Input/Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBCSX_1E" -->
            <field>
              <name>HBCSX_1E</name>
              <description>GE_HBCSX_1 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBCSX_0E" -->
            <field>
              <name>HBCSX_0E</name>
              <description>GE_HBCSX_0 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HBCKE" -->
            <field>
              <name>HBCKE</name>
              <description>GE_HBCK Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR28" -->
        <register>
          <name>EPFR28</name>
          <description>Extended Pin Function Setting Register 28 [BHW]</description>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PNL_PD15E" -->
            <field>
              <name>PNL_PD15E</name>
              <description>PNL_PD15 Output Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD14E" -->
            <field>
              <name>PNL_PD14E</name>
              <description>PNL_PD14 Output Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD13E" -->
            <field>
              <name>PNL_PD13E</name>
              <description>PNL_PD13 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD12E" -->
            <field>
              <name>PNL_PD12E</name>
              <description>PNL_PD12 Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD11E" -->
            <field>
              <name>PNL_PD11E</name>
              <description>PNL_PD11 Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD10E" -->
            <field>
              <name>PNL_PD10E</name>
              <description>PNL_PD10 Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD9E" -->
            <field>
              <name>PNL_PD9E</name>
              <description>PNL_PD9 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD8E" -->
            <field>
              <name>PNL_PD8E</name>
              <description>PNL_PD8 Output Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD7E" -->
            <field>
              <name>PNL_PD7E</name>
              <description>PNL_PD7 Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD6E" -->
            <field>
              <name>PNL_PD6E</name>
              <description>PNL_PD6 Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD5E" -->
            <field>
              <name>PNL_PD5E</name>
              <description>PNL_PD5 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD4E" -->
            <field>
              <name>PNL_PD4E</name>
              <description>PNL_PD4 Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD3E" -->
            <field>
              <name>PNL_PD3E</name>
              <description>PNL_PD3 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD2E" -->
            <field>
              <name>PNL_PD2E</name>
              <description>PNL_PD2 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD1E" -->
            <field>
              <name>PNL_PD1E</name>
              <description>PNL_PD1 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD0E" -->
            <field>
              <name>PNL_PD0E</name>
              <description>PNL_PD0 Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
