mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "EXTFLASHDEVSELECT" -->
        <register>
          <name>EXTFLASHDEVSELECT</name>
          <description>External Flash Device Selection register [W]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTFLASHDEVSELECT" -->
            <field>
              <name>EXTFLASHDEVSELECT</name>
              <description>External memory device selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAMREMAPDISABLE" -->
        <register>
          <name>VRAMREMAPDISABLE</name>
          <description>VRAM Remap Mode Disable register [W]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAMREMAPDISABLE" -->
            <field>
              <name>VRAMREMAPDISABLE</name>
              <description>VRAM address remap or non-remap selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PANICSWITCH" -->
        <register>
          <name>PANICSWITCH</name>
          <description>Panic display mode switch register [W]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PANICSWITCH" -->
            <field>
              <name>PANICSWITCH</name>
              <description>Panic display mode or Normal display mode selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GDC_CLOCKDIVIDER" -->
        <register>
          <name>GDC_CLOCKDIVIDER</name>
          <description>GDC Clock Generation Control register [W]</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GDCCLOCKSELECT" -->
            <field>
              <name>GDCCLOCKSELECT</name>
              <description>GDC clock generation control bits</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WKUPTRIGGERMASK" -->
        <register>
          <name>WKUPTRIGGERMASK</name>
          <description>CPU wake-up trigger Mask register [W]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0707FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTRIGMASKRPC" -->
            <field>
              <name>WTRIGMASKRPC</name>
              <description>Wake up trigger mask for HyperBus interface</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WTRIGMASKSDRAM" -->
            <field>
              <name>WTRIGMASKSDRAM</name>
              <description>Wake up trigger mask for SDRAM interface</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WTRIGMASKQSPI" -->
            <field>
              <name>WTRIGMASKQSPI</name>
              <description>Wake up trigger mask for QSPI interface</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WTRIGMASKGE" -->
            <field>
              <name>WTRIGMASKGE</name>
              <description>Wake up trigger mask for GDC Core</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLOCKDOMAINSTATUS" -->
        <register>
          <name>CLOCKDOMAINSTATUS</name>
          <description>Clock Domain Status Indication register [W]</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSSPICLOCKDOMAINREADY" -->
            <field>
              <name>HSSPICLOCKDOMAINREADY</name>
              <description>Clock Status of QSPI interface clock domain</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPCCLOCKDOMAINREADY" -->
            <field>
              <name>RPCCLOCKDOMAINREADY</name>
              <description>Clock Status of HyperBus interface clock domain</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAMCLOCKDOMAINREADY" -->
            <field>
              <name>SDRAMCLOCKDOMAINREADY</name>
              <description>Clcok Status of SDRAM interface clock domain</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSPCLOCKDOMAINREADY" -->
            <field>
              <name>DSPCLOCKDOMAINREADY</name>
              <description>Clock Status of Display clock domain</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
