mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxj/s6e2dfxj.svd
        <!-- REGISTER "SDRAMC_DOMAINCONTROL" -->
        <register>
          <name>SDRAMC_DOMAINCONTROL</name>
          <description>SDRAM interface clock domain setting register [W]</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDRAMC_SOFTWARERESET" -->
            <field>
              <name>SDRAMC_SOFTWARERESET</name>
              <description>Software reset for SDRAM interface clock domain</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAMC_CLOCKENABLE" -->
            <field>
              <name>SDRAMC_CLOCKENABLE</name>
              <description>SDRAM interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIC_CLOCKDIVIDER" -->
        <register>
          <name>HSSPIC_CLOCKDIVIDER</name>
          <description>Division Ratio of QSPI interface setting register [W]</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSSPIC_CLOCKDIVIDER" -->
            <field>
              <name>HSSPIC_CLOCKDIVIDER</name>
              <description>Division Ratio from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIC_DOMAINCONTROL" -->
        <register>
          <name>HSSPIC_DOMAINCONTROL</name>
          <description>QSPI interface clock domain setting register [W]</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSSPIC_SOFTWARERESET" -->
            <field>
              <name>HSSPIC_SOFTWARERESET</name>
              <description>Software reset for QSPI interface clock domain</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HSSPIC_CLOCKENABLE" -->
            <field>
              <name>HSSPIC_CLOCKENABLE</name>
              <description>QSPI interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPCC_CLOCKDIVIDER" -->
        <register>
          <name>RPCC_CLOCKDIVIDER</name>
          <description>Division Ratio of HyperBus interface setting register [W]</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPCC_CLOCKDIVIDER" -->
            <field>
              <name>RPCC_CLOCKDIVIDER</name>
              <description>Division Ratio from the Reference clock for peripherals</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPCC_DOMAINCONTROL" -->
        <register>
          <name>RPCC_DOMAINCONTROL</name>
          <description>HyperBus interface clock domain setting register [W]</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPCC_CLOCKENABLE" -->
            <field>
              <name>RPCC_CLOCKENABLE</name>
              <description>HyperBus interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAM_LOCKUNLOCK" -->
        <register>
          <name>VRAM_LOCKUNLOCK</name>
          <description>VRAM LockUnlock Register [W]</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAM_LOCKUNLOCK" -->
            <field>
              <name>VRAM_LOCKUNLOCK</name>
              <description>$</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAM_LOCKSTATUS" -->
        <register>
          <name>VRAM_LOCKSTATUS</name>
          <description>Protection status Indication of this address block [W]</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000111</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAM_FREEZESTATUS" -->
            <field>
              <name>VRAM_FREEZESTATUS</name>
              <description>Current status of freeze status</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "VRAM_PRIVILEGESTATUS" -->
            <field>
              <name>VRAM_PRIVILEGESTATUS</name>
              <description>Current status of previlege protection</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "VRAM_LOCKSTATUS" -->
            <field>
              <name>VRAM_LOCKSTATUS</name>
              <description>Current status of lock protection</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAM_SRAM_SELECT" -->
        <register>
          <name>VRAM_SRAM_SELECT</name>
          <description>Size of the ECC protected memory region selection register [W]</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAM_SRAM_SELECT" -->
            <field>
              <name>VRAM_SRAM_SELECT</name>
              <description>Selects the size of the ECC protected region</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
